<template>
    <div class ='wrapper'>
<!--      <h1>Category()</h1>-->
      <ul>
        <li>用户数据————————————————1</li>
        <li>用户数据————————————————2</li>
        <li>用户数据————————————————3</li>
        <li>用户数据————————————————4</li>
        <li>用户数据————————————————5</li>
        <li>用户数据————————————————6</li>
        <li>用户数据————————————————7</li>
        <li>用户数据————————————————8</li>
        <li>用户数据————————————————9</li>
        <li>用户数据————————————————10</li>
        <li>用户数据————————————————11</li>
        <li>用户数据————————————————12</li>
        <li>用户数据————————————————13</li>
        <li>用户数据————————————————14</li>
        <li>用户数据————————————————15</li>
        <li>用户数据————————————————16</li>
        <li>用户数据————————————————17</li>
        <li>用户数据————————————————18</li>
        <li>用户数据————————————————19</li>
        <li>用户数据————————————————20</li>
        <li>用户数据————————————————21</li>
        <li>用户数据————————————————22</li>
        <li>用户数据————————————————23</li>
        <li>用户数据————————————————24</li>
        <li>用户数据————————————————25</li>
        <li>用户数据————————————————26</li>
        <li>用户数据————————————————27</li>
        <li>用户数据————————————————28</li>
        <li>用户数据————————————————29</li>
        <li>用户数据————————————————30</li>
        <li>用户数据————————————————31</li>
        <li>用户数据————————————————32</li>
        <li>用户数据————————————————33</li>
        <li>用户数据————————————————34</li>
        <li>用户数据————————————————35</li>
        <li>用户数据————————————————36</li>
        <li>用户数据————————————————37</li>
        <li>用户数据————————————————38</li>
        <li>用户数据————————————————39</li>
        <li>用户数据————————————————40</li>
        <li>用户数据————————————————41</li>
        <li>用户数据————————————————42</li>
        <li>用户数据————————————————43</li>
        <li>用户数据————————————————44</li>
        <li>用户数据————————————————45</li>
        <li>用户数据————————————————46</li>
        <li>用户数据————————————————47</li>
        <li>用户数据————————————————48</li>
        <li>用户数据————————————————49</li>
        <li>用户数据————————————————50</li>
        <li>用户数据————————————————51</li>
        <li>用户数据————————————————52</li>
        <li>用户数据————————————————53</li>
        <li>用户数据————————————————54</li>
        <li>用户数据————————————————55</li>
        <li>用户数据————————————————56</li>
        <li>用户数据————————————————57</li>
        <li>用户数据————————————————58</li>
        <li>用户数据————————————————59</li>
        <li>用户数据————————————————60</li>
        <li>用户数据————————————————61</li>
        <li>用户数据————————————————62</li>
        <li>用户数据————————————————63</li>
        <li>用户数据————————————————64</li>
        <li>用户数据————————————————65</li>
        <li>用户数据————————————————66</li>
        <li>用户数据————————————————67</li>
        <li>用户数据————————————————68</li>
        <li>用户数据————————————————69</li>
        <li>用户数据————————————————70</li>
        <li>用户数据————————————————71</li>
        <li>用户数据————————————————72</li>
        <li>用户数据————————————————73</li>
        <li>用户数据————————————————74</li>
        <li>用户数据————————————————75</li>
        <li>用户数据————————————————76</li>
        <li>用户数据————————————————77</li>
        <li>用户数据————————————————78</li>
        <li>用户数据————————————————79</li>
        <li>用户数据————————————————80</li>
        <li>用户数据————————————————81</li>
        <li>用户数据————————————————82</li>
        <li>用户数据————————————————83</li>
        <li>用户数据————————————————84</li>
        <li>用户数据————————————————85</li>
        <li>用户数据————————————————86</li>
        <li>用户数据————————————————87</li>
        <li>用户数据————————————————88</li>
      </ul>
      <Footer/>
    </div>
</template>

<script>
import BScroll from 'better-scroll'
import Footer from '../../components/Footer'
export default {
  name: 'Category',
  components: {
    Footer
  },
  data () {
    return {
      scroll: null
    }
  },
  mounted () {
    this.scroll = new BScroll(document.querySelector('.wrapper'), {
      probeType: 2,
      pullUpLoad: true
    })
    this.scroll.on('scroll', position => {
      // console.log(position)
    })
    this.scroll.on('pullingUp', () => {
      console.log('上拉加载更多')
    })
  }
}
</script>

<style scoped lang="stylus">
  .wrapper
    height 200px
    background-color palevioletred
    overflow hidden

</style>
